In [1]:
import pandas

In [2]:
pandas.__version__

'1.0.4'

In [6]:
import numpy as np
import pandas as pd

In [7]:
counts=pd.Series([123,456,346,879])
counts

0    123
1    456
2    346
3    879
dtype: int64

In [8]:
counts.values

array([123, 456, 346, 879])

In [9]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
bacteria=pd.Series([123,456,346,879],
                   index=['a','b','c','d'])
bacteria

a    123
b    456
c    346
d    879
dtype: int64

In [11]:
bacteria['d']

879

In [12]:
bacteria[0]

123

In [14]:
bacteria[3]

879

In [15]:
bacteria.name='counts'
bacteria.index.name='phylum'
bacteria

phylum
a    123
b    456
c    346
d    879
Name: counts, dtype: int64

In [16]:
np.log(bacteria)

phylum
a    4.812184
b    6.122493
c    5.846439
d    6.778785
Name: counts, dtype: float64

In [17]:
bacteria[bacteria>300]

phylum
b    456
c    346
d    879
Name: counts, dtype: int64

In [18]:
bacteria_dict={'a':123,'b':456,'c':346,'d':879}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'a': 123, 'b': 456, 'c': 346, 'd': 879}

a    123
b    456
c    346
d    879
dtype: int64

In [19]:
data={"Student_age":[23,24,25,26],
      "birth_year":[1996,1997,1995,1998],
      "name":["ram","shyam","gita","sita"]}
print(data)
data=pd.DataFrame(data)
data

{'Student_age': [23, 24, 25, 26], 'birth_year': [1996, 1997, 1995, 1998], 'name': ['ram', 'shyam', 'gita', 'sita']}

   Student_age  birth_year   name
0           23        1996    ram
1           24        1997  shyam
2           25        1995   gita
3           26        1998   sita

In [21]:
df=pd.DataFrame(data,columns=["birth_year","Student_age","name"])
df

   birth_year  Student_age   name
0        1996           23    ram
1        1997           24  shyam
2        1995           25   gita
3        1998           26   sita

In [22]:
df['random']=df.birth_year/df.Student_age

In [23]:
df

   birth_year  Student_age   name     random
0        1996           23    ram  86.782609
1        1997           24  shyam  83.208333
2        1995           25   gita  79.800000
3        1998           26   sita  76.846154

In [24]:
df['Series_alinged']=pd.Series(range(5),index=[0,1,2,3,4])

In [25]:
df

   birth_year  Student_age   name     random  Series_alinged
0        1996           23    ram  86.782609               0
1        1997           24  shyam  83.208333               1
2        1995           25   gita  79.800000               2
3        1998           26   sita  76.846154               3

In [26]:
df.to_dict()

{'birth_year': {0: 1996, 1: 1997, 2: 1995, 3: 1998},
 'Student_age': {0: 23, 1: 24, 2: 25, 3: 26},
 'name': {0: 'ram', 1: 'shyam', 2: 'gita', 3: 'sita'},
 'random': {0: 86.78260869565217,
  1: 83.20833333333333,
  2: 79.8,
  3: 76.84615384615384},
 'Series_alinged': {0: 0, 1: 1, 2: 2, 3: 3}}

In [27]:
pd.DataFrame(df.to_dict())

   birth_year  Student_age   name     random  Series_alinged
0        1996           23    ram  86.782609               0
1        1997           24  shyam  83.208333               1
2        1995           25   gita  79.800000               2
3        1998           26   sita  76.846154               3

In [28]:
data=[{'a':i,'b':10*i} for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [29]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':4}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  4.0